In [1]:
import pandas as pd
cols= ('date', 'Puenta76', 'Lake76')
df = pd.read_csv('atm0.csv', names=cols)
df.head()

         date  Puenta76  Lake76
0  2016-12-01     177.6   258.0
1     11/2016     198.0   262.8
2     10/2016     189.6   268.8
3      9/2016     196.8   250.8
4      8/2016     194.4   259.2

# loc use 'label' to select from dataform

In [2]:
df.loc[0:3, ['date','Puenta76']]

         date  Puenta76
0  2016-12-01     177.6
1     11/2016     198.0
2     10/2016     189.6
3      9/2016     196.8

# Change  value of single cell in dateform

In [3]:
df.loc[0:0, 'date']="2017"

In [4]:
df.loc[0:0, :]

   date  Puenta76  Lake76
0  2017     177.6   258.0

In [5]:
df[df.Puenta76 >= 200]

     date  Puenta76  Lake76
5  7/2016     237.6   146.4
6  6/2016     205.2   182.4
7  5/2016     214.8   211.2
8  4/2016     200.4   182.4
9  3/2016     235.2   129.6

### iloc function use numbers to select from dateform, Attn. the end number will be exlusived.

In [6]:
df.iloc[1:5, 0:2]

      date  Puenta76
1  11/2016     198.0
2  10/2016     189.6
3   9/2016     196.8
4   8/2016     194.4

In [7]:
imdb = pd.read_csv('imdb.csv')
def changetime(time):
    minute = time % 60
    hour = time // 60
    return str(hour)+':'+str(minute)
imdb['length']=imdb.duration.map(changetime)
imdb.head()

,star_rating,title,content_rating,genre,duration,actors_list,length
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...",2:22
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']",2:55
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv...",3:20
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E...",2:32
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L....",2:34

In [8]:
import numpy as np
imdb[imdb.duration == imdb['duration'].max()]

,star_rating,title,content_rating,genre,duration,actors_list,length
476,7.8,Hamlet,PG-13,Drama,242,"[u'Kenneth Branagh', u'Julie Christie', u'Dere...",4:2

Read Powerball luck draw data text file into a dataform

In [9]:
pb = pd.read_table('http://www.powerball.com/powerball/winnums-text.txt')

In [10]:
pb.columns

Index(['Draw Date   WB1 WB2 WB3 WB4 WB5 PB  PP'], dtype='object')

From array create a dateform

In [11]:
arr = np.arange(10,100,2)
len(arr)
numdf = pd.DataFrame(arr.reshape(5,9))
numdf.loc[0,]

0    10
1    12
2    14
3    16
4    18
5    20
6    22
7    24
8    26
Name: 0, dtype: int64

## Creat a dataframe from map

In [12]:
http://www.wenxuecity.com/news/newdata = {'Col1':[1,11,111,1111,11111],
           'Col2':[2,22,222,2222,22222],
           'Col3':[3,33,333,3333,33333],}
newdf = pd.DataFrame(newdata)
newdf

    Col1   Col2   Col3
0      1      2      3
1     11     22     33
2    111    222    333
3   1111   2222   3333
4  11111  22222  33333

## use mask to select DataFrame, The column names must be the same

In [13]:
df_mask = pd.DataFrame({'Col1' : [True] * 5, 'Col2' : [False] * 5,'Col3' : [True,False,True,False,True]})
df_mask

   Col1   Col2   Col3
0  True  False   True
1  True  False  False
2  True  False   True
3  True  False  False
4  True  False   True

### numpy where functio return the 2nd parameters when 1st is ture, return 3rd when not.

In [14]:
np.where(df_mask, 1, 0)

array([[1, 0, 1],
       [1, 0, 0],
       [1, 0, 1],
       [1, 0, 0],
       [1, 0, 1]])

In [49]:
myindex = np.arange(0,100,10)
myindex

array([ 0, 10, 20, 30, 40, 50, 60, 70, 80, 90])

In [52]:
dfn = pd.DataFrame(np.random.randn(10,5), columns = ['A','B','C','D','E'],
                  index=myindex)
dfn,dfn.sort_values(['A'])

(           A         B         C         D         E
 0   0.357093 -2.358439 -0.938885  1.716058  1.710677
 10 -1.458260 -0.497747  0.067208  0.532631 -1.584136
 20 -0.962254 -0.091630  1.902700  1.287290 -0.901270
 30 -1.994113  0.642830 -0.207043  1.968747 -1.127919
 40 -1.278585 -0.566857  0.221952  0.556562 -0.366129
 50 -0.324293 -2.404273 -1.486534  0.054071 -0.663363
 60 -0.049192 -0.477085 -0.025007  1.163879 -1.365292
 70  1.222171 -0.441088  0.425505 -0.702719  1.993626
 80  1.305539 -0.394770  0.321210  0.163603  0.204182
 90 -0.760456 -0.459498  0.181245  0.053896 -1.162471,
            A         B         C         D         E
 30 -1.994113  0.642830 -0.207043  1.968747 -1.127919
 10 -1.458260 -0.497747  0.067208  0.532631 -1.584136
 40 -1.278585 -0.566857  0.221952  0.556562 -0.366129
 20 -0.962254 -0.091630  1.902700  1.287290 -0.901270
 90 -0.760456 -0.459498  0.181245  0.053896 -1.162471
 50 -0.324293 -2.404273 -1.486534  0.054071 -0.663363
 60 -0.049192 -0.477085 -0.025007  1.163879 -1.365292
 0   0.357093 -2.358439 -0.938885  1.716058  1.710677
 70  1.222171 -0.441088  0.425505 -0.702719  1.993626
 80  1.305539 -0.394770  0.321210  0.163603  0.204182)

In [117]:
dfn.drop(dfn.index[1]),dfn

(           A         B         C         D         E
 0   0.357093 -2.358439 -0.938885  1.716058  1.710677
 20 -0.962254 -0.091630  1.902700  1.287290 -0.901270
 30 -1.994113  0.642830 -0.207043  1.968747 -1.127919
 40 -1.278585 -0.566857  0.221952  0.556562 -0.366129
 50 -0.324293 -2.404273 -1.486534  0.054071 -0.663363
 60 -0.049192 -0.477085 -0.025007  1.163879 -1.365292
 70  1.222171 -0.441088  0.425505 -0.702719  1.993626
 80  1.305539 -0.394770  0.321210  0.163603  0.204182
 90 -0.760456 -0.459498  0.181245  0.053896 -1.162471,
            A         B         C         D         E
 0   0.357093 -2.358439 -0.938885  1.716058  1.710677
 10 -1.458260 -0.497747  0.067208  0.532631 -1.584136
 20 -0.962254 -0.091630  1.902700  1.287290 -0.901270
 30 -1.994113  0.642830 -0.207043  1.968747 -1.127919
 40 -1.278585 -0.566857  0.221952  0.556562 -0.366129
 50 -0.324293 -2.404273 -1.486534  0.054071 -0.663363
 60 -0.049192 -0.477085 -0.025007  1.163879 -1.365292
 70  1.222171 -0.441088  0.425505 -0.702719  1.993626
 80  1.305539 -0.394770  0.321210  0.163603  0.204182
 90 -0.760456 -0.459498  0.181245  0.053896 -1.162471)

In [130]:
dfn[dfn.index>50]

           A         B         C         D         E
60 -0.049192 -0.477085 -0.025007  1.163879 -1.365292
70  1.222171 -0.441088  0.425505 -0.702719  1.993626
80  1.305539 -0.394770  0.321210  0.163603  0.204182
90 -0.760456 -0.459498  0.181245  0.053896 -1.162471

In [128]:
dfn.sample(4)

           A         B         C         D         E
20 -0.962254 -0.091630  1.902700  1.287290 -0.901270
10 -1.458260 -0.497747  0.067208  0.532631 -1.584136
0   0.357093 -2.358439 -0.938885  1.716058  1.710677
60 -0.049192 -0.477085 -0.025007  1.163879 -1.365292